Обработки/Reports/_НепогашенныеЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_НепогашенныеЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключаемыеСчета</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_НепогашенныеЗадолженности/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	// Данные по умолчанию
	
	Отчет.Период		= ТекущаяДатаСеанса();
	Отчет.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЗаполнитьИсключаемыеСчета();
	
	ОбновитьКоличествоИсключаемыхСчетов(ЭтаФорма);
	
	// Видимость и настройки элементов
	
	Элементы.Организация.Видимость			= РаботаСПользователями.ЭтоПолноправныйПользователь();
	Элементы.ОрганизацияНадпись.Видимость	= Не Элементы.Организация.Видимость;
	
	Элементы.ИсключаемыеСчетаЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);	
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьИсключаемыеПоУмолчаниюСчета(Команда)
	
	ЗаполнитьИсключаемыеПоУмолчаниюСчета();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ЗаполнитьИсключаемыеПоУмолчаниюСчета();	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключаемыеСчетаПриИзменении(Элемент)

	ОбновитьКоличествоИсключаемыхСчетов(ЭтаФорма);	
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

Процедура ЗаполнитьИсключаемыеСчета()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ОтчетОбъект.ЗаполнитьИсключаемыеСчета();
	
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКоличествоИсключаемыхСчетов(ЭтаФорма)
	
	КоличествоИсключаемыхСчетов = ЭтаФорма.Отчет.ИсключаемыеСчета.Количество();
	
	ЭтаФорма.Элементы.ГруппаИсключаемыеСчета.Заголовок = "Исключаемые счета"
		+ ?(КоличествоИсключаемыхСчетов = 0, "", СтрШаблон(" [%1]", КоличествоИсключаемыхСчетов));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииПараметровОтчета(ЭтаФорма)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат, "НеАктуальность");		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсключаемыеПоУмолчаниюСчета()
	
	Если ЗначениеЗаполнено(Отчет.Организация) Тогда
		ЗаполнитьИсключаемыеСчета();
	Иначе
		Отчет.ИсключаемыеСчета.Очистить();
	КонецЕсли;
	
	ОбновитьКоличествоИсключаемыхСчетов(ЭтаФорма);
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);

КонецПроцедуры
